{
    "pages": [
        {
            "page": 1,
            "narration": "同学们好呀！欢迎来到今天的数学课～咱们今天要学的内容是“等腰三角形判定”，这部分知识属于八年级上册人教版数学第十三章轴对称的内容。接下来咱们就一起探索等腰三角形的小秘密，争取今天都能把它吃透，好不好？"
        },
        {
            "page": 2,
            "narration": "在正式开始前，咱们先明确一下今天的学习目标和重点难点。首先要一起探索等腰三角形的判定定理，然后得理解这个定理，还会用它做简单的证明。重点呢，就是理解和运用这个判定定理；不过难点也在这儿，既要探索出定理，还得会灵活应用。大家心里有谱了吧，那咱们先回顾下之前学的等腰三角形性质，为新知识打基础～"
        },
        {
            "page": 3,
            "narration": "咱们先来回顾下等腰三角形的老知识！首先，什么是等腰三角形呀？对啦，就是有两条边相等的三角形。那它有哪些性质呢？第一条，两个底角相等，咱们简单记成“等边对等角”，意思就是两条边相等，它们对着的角就相等。第二条更重要，顶角的平分线、底边上的中线还有底边上的高是重合的，这叫“三线合一”。还有一条，等腰三角形是轴对称图形，沿着对称轴对折，两边能完全重合。这些都记牢了吧，接下来就要用这些知识学新内容啦！"
        },
        {
            "page": 4,
            "narration": "咱们之前知道，如果一个三角形有两条边相等，那它们对着的角就相等，也就是“等边对等角”。那大家有没有想过反过来的情况呢？如果一个三角形有两个角相等，那这两个角对着的边会有什么关系呀？大家看黑板上这个三角形ABC，假设角B等于角C，你们猜AB和AC这两条边会不会相等呀？先大胆猜一猜，咱们接下来就来验证这个猜想对不对～"
        },
        {
            "page": 5,
            "narration": "现在咱们就来证明刚才的猜想：已知三角形ABC里，角B等于角C，要证明AB等于AC。怎么证明呢？咱们可以给这个三角形添一条辅助线，作角BAC的平分线AD，这样就把角BAC分成了两个相等的角，也就是角1等于角2。现在看三角形BAD和三角形CAD，里面有角1等于角2，角B等于角C，还有公共边AD等于AD。根据咱们学过的全等三角形判定方法，这两个三角形是全等的。全等三角形的对应边相等，所以AB就等于AC啦！这样咱们就证明了刚才的猜想是对的～"
        },
        {
            "page": 6,
            "narration": "通过刚才的证明，咱们就得出了等腰三角形的判定定理：如果一个三角形有两个角相等，那么这两个角所对的边也相等，简单记成“等角对等边”。用几何语言怎么说呢？就是在三角形ABC中，如果角B等于角C，那么AB就等于AC，依据就是“等角对等边”。这里有两个重要的注意点，大家一定要记好：第一，用“等角对等边”的前提是这两个角在同一个三角形里；第二，咱们之前学的等腰三角形定义，也就是有两条边相等的三角形是等腰三角形，这个定义也能用来判定一个三角形是不是等腰三角形。这两点可别搞错啦！"
        },
        {
            "page": 7,
            "narration": "咱们现在来区分一下等腰三角形的性质定理和判定定理，别把它们弄混了。性质定理是“等边对等角”，意思是先知道两条边相等，再推出它们对着的角相等；而判定定理是“等角对等边”，是先知道两个角相等，再推出它们对着的边相等。你看，一个是从边相等推角相等，一个是从角相等推边相等，方向不一样，用途也不一样。性质定理是用来知道边相等后求角的关系，判定定理是用来知道角相等后判断边的关系，这下能分清了吧？"
        },
        {
            "page": 8,
            "narration": "咱们现在来做第一道课堂测试题，检验下大家学得怎么样。题目是：求证如果三角形一个外角的平分线平行于三角形的一边，那么这个三角形是等腰三角形。已知图里角CAE是三角形ABC的外角，角1等于角2，AD平行于BC，要证明AB等于AC。大家先想想怎么证？首先，AD平行于BC，根据平行线的性质，同位角相等，所以角1等于角B；内错角也相等，所以角2等于角C。又因为角1等于角2，那是不是就能推出角B等于角C啦？根据“等角对等边”，角B等于角C，所以AB就等于AC，这样就证明这个三角形是等腰三角形了。大家是不是也这么想的呀？"
        },
        {
            "page": 9,
            "narration": "接下来是第二道题，是作图题：已知等腰三角形的底边长是a，底边上的高是h，要作出这个等腰三角形。怎么作呢？咱们一步一步来。第一步，先画一条线段AB，让它的长度等于a，这就是等腰三角形的底边。第二步，作线段AB的垂直平分线MN，这条线会和AB相交于点D，D点就是AB的中点啦。第三步，在垂直平分线MN上找一个点C，让DC的长度等于h，这个h就是底边上的高。第四步，把点A和点C、点B和点C连接起来，这样三角形ABC就是咱们要作的等腰三角形啦。大家跟着步骤画一画，是不是很简单呀？"
        },
        {
            "page": 10,
            "narration": "第三道题是选择题，问哪个选项能判定三角形ABC是等腰三角形。咱们一个一个来看选项。选项A里，角A是30度，角B是60度，那角C就是180度减30度减60度，等于90度，三个角都不一样，所以不是等腰三角形。选项B里，角A是50度，角B是80度，角C就是180度减50度减80度，等于50度，角A和角C相等，根据“等角对等边”，这个三角形是等腰三角形。选项C里，角A等于2倍的角B，还等于80度，那角B就是40度，角C就是60度，三个角都不相等，不是等腰三角形。选项D里，AB是3，BC是6，周长是13，那AC就是13减6减3，等于4，三条边都不一样，不是等腰三角形。所以正确答案就是选项B，大家选对了吗？"
        },
        {
            "page": 11,
            "narration": "第四道题也是选择题，图里有三角形ABC和三角形DCB，已知角A和角D都是72度，角ACB和角DBC都是36度，问图里有多少个等腰三角形。咱们先算一算各个角的度数。首先，角ACB等于角DBC，都是36度，那角AOB和角DOC就等于这两个角的和，也就是72度。角A是72度，所以角A等于角AOB，角A也等于角ABC，这样三角形ABO和三角形ABC就是等腰三角形。然后，角OBC和角OCB都是36度，相等，所以三角形OBC也是等腰三角形。角D是72度，等于角DOC，也等于角DCB，所以三角形DCO和三角形DBC也是等腰三角形。这样算下来，一共有5个等腰三角形，所以答案是选项D，大家数对了吗？"
        },
        {
            "page": 12,
            "narration": "第五道题还是选择题，图里角1等于角2，角C等于角D，AC和BD交于E点，问下面四个结论里正确的有几个。咱们先看，在三角形ABD和三角形BAC里，角1等于角2，角C等于角D，还有公共边AB等于BA，所以这两个三角形全等。全等之后，角DAB等于角CBA，AD等于BC。再看三角形DEA和三角形CBE，有角D等于角C，AD等于BC，还有对顶角相等，所以这两个三角形也全等。全等之后，角DAE等于角CBE，CE等于DE，AE等于BE。AE等于BE的话，三角形EAB就是等腰三角形。所以这四个结论都是正确的，答案是选项D，大家判断对了吗？"
        },
        {
            "page": 13,
            "narration": "第六道题是证明题，已知AD平行于BC，BD平分角ABC，要证明AB等于AD。大家先想，AD平行于BC，根据平行线的性质，内错角相等，所以角ADB等于角DBC。又因为BD平分角ABC，所以角ABD等于角DBC。这样一来，角ABD就等于角ADB了，根据“等角对等边”，AB就等于AD啦。是不是很简单呀，大家自己也能试着证一证～"
        },
        {
            "page": 14,
            "narration": "第七道题也是证明题，图里AC和BD相交于点O，AB平行于DC，OA等于OB，要证明OC等于OD。首先，OA等于OB，根据“等边对等角”，角A等于角B。然后，AB平行于DC，根据平行线的性质，内错角相等，所以角A等于角C，角B等于角D。这样一来，角C就等于角D了，再根据“等角对等边”，OC就等于OD啦。这道题把性质定理和判定定理结合起来用了，大家是不是也会做呀？"
        },
        {
            "page": 15,
            "narration": "好啦，今天关于等腰三角形判定的内容就全部讲完啦。大家这节课不仅学会了等腰三角形的判定定理“等角对等边”，还能区分它和性质定理的不同，也会用定理做证明和作图题了，收获肯定不少吧！希望大家课后再好好复习一下，把今天学的知识巩固好，下次上课咱们再一起学新内容。感谢大家今天的认真聆听，下课啦！"
        }
    ]
}